init.org
#+TITLE: Emacs config
#+AUTHOR:Devin Sackett
#+EMAIL: dsac@hotmail.com 
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

#+begin_src emacs-lisp
  (setq user-full-name "Devin Sackett")
  (setq user-mail-address "dsac@hotmail.com")
#+end_src

* todo

- [ ] treemacs as other window
- [ ] treemacs only shows the current projectile project or current folder
- [ ] remove top border, to matches buffer
- [ ] yasnippet
- [ ] fix projectile search regex
- [ ] fix auto completion when typing word fills the word
- [ ] make shift arrows work in org mode
- [ ] fix error: Eager macro-expansion failure: (wrong-type-argument listp [(first-item . rest-items) (sp-get-list-items)]) occurs when loading smartparens
- [ ] if electric-pair-mode works, move the configuration to correct stop 

* initial view setup

** scroll bar

#+begin_src emacs-lisp
  (scroll-bar-mode -1)
#+end_src

** toolbar

#+begin_src emacs-lisp
  (tool-bar-mode -1)
#+end_src

** tooltip

#+begin_src emacs-lisp
  (tooltip-mode -1)
#+end_src

** menu bar

#+begin_src emacs-lisp
  (menu-bar-mode -1)
#+end_src

** startup message

Disable the initial startup message, remove the *scratch* buffer's message and initialize the major mode as =fundamental-mode=

#+begin_src emacs-lisp
  (setq inhibit-startup-message t
        initial-scratch-message ""
        initial-major-mode 'fundamental-mode)
#+end_src

** visual bell

Remove any visual and audiable indications that some wrong was done

#+begin_src emacs-lisp
  (setq visible-bell 1)
  (setq ring-bell-function 'ignore)
#+end_src

* bootstrap

** start performance

#+begin_src emacs-lisp
  (defun yiglas-display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                       (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'yiglas-display-startup-time)
#+end_src

** package management via straight.el

[[https://github.com/raxod502/straight.el][straight.el]] is an alternate to the built in package.el with many advantages including ability to integrate with [[https://github.com/jwiegley/use-package][use-package]] and installing packages from git or github

#+begin_src emacs-lisp
  ;; (defvar bootstrap-version)
  ;; (let ((bootstrap-file
  ;;        (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
  ;;       (bootstrap-version 5))
  ;;   (unless (file-exists-p bootstrap-file)
  ;;     (with-current-buffer
  ;;         (url-retrieve-synchronously
  ;;          "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
  ;;          'silent 'inhibit-cookies)
  ;;       (goto-char (point-max))
  ;;       (eval-print-last-sexp)))
  ;;   (load bootstrap-file nil 'nomessage))
#+end_src

*** use-package integration

#+begin_src emacs-lisp
  ;; (setq straight-use-package-by-default t)

  ;; (straight-use-package 'use-package)

  ;; (require 'use-package)
  ;; (setq use-package-always-ensure t)
  ;; (setq use-package-verbose t)

  ;; (use-package git) ;; ensure we can install from git sources
#+end_src

** use-package

[[https://github.com/jwiegley/use-package][use-package]] is a Package Manager for Emacs.

#+begin_src emacs-lisp
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
  (setq use-package-verbose t)
#+end_src

* helpers

Some conveinet shorthand macros

** :func

Make non-interactive functions

examples
=(:func (message "hello world"))=
=(:func foobar)=

#+begin_src emacs-lisp
  (defmacro :func (&rest body)
    (if (< (length body) 1)
	`(lambda () ,@body)
      (pcase (car body)
	;; command symbol
	((and v (pred commandp))
	 `(lambda () (call-interactively (quote ,v))))
	;; function symbol
	((and v (pred symbolp))
	 `(lambda () (,v)))
	;; quoted command symbol
	((and v (pred consp) (guard (eq 'quote (car v))) (pred commandp (cadr v)))
	 `(lambda () (call-interactively ,v)))
	;; quoted function symbol
	((and v (pred consp) (guard (eq 'quote (car v))))
	 `(lambda () (,(cadr v))))
	;; body format
	(_ `(lambda () ,@body)))))
#+end_src

** :command

Make interactive commands

examples:
=(:command (message "hello world"))=
=(:command foobar)=

#+begin_src emacs-lisp
  (defmacro :command (&rest body)
    (if (< (length body) 1)
	`(lambda () (interactive) ,@body)
      (pcase (car body)
	;; command symbol
	((and v (pred commandp))
	 `(lambda () (interactive) (call-interactively (quote ,v))))
	;; function symbol
	((and v (pred symbolp))
	 `(lambda () (interactive) (,v)))
	;; quoted command symbol
	((and v (pred consp) (guard (eq 'quote (car v))) (pred commandp (cadr v)))
	 `(lambda () (interactive) (call-interactively ,v)))
	;; quoted function symbol
	((and v (pred consp) (guard (eq 'quote (car v))))
	 `(lambda () (interactive) (,(cadr v))))
	;; body forms
	(_ `(lambda () (interactive) ,@body)))))
#+end_src

** :after

Wrapper for the *with-eval-after-load* function

examples:
=(:after org (message "hello world"))=

#+begin_src emacs-lisp
  ;; (defmacro :after (package &rest body)
  ;;   (declare (indent defun))
  ;;   `(with-eval-after-load ',package ,@body))

  (defmacro :after (package &rest body)
    (declare (indent defun) (debug t))
    (if (symbolp package)
        (list (if (or (not (bound-and-true-p byte-compile-current-file))
                      (require package nil 'noerror))
                  #'progn
                #'with-no-warnings)
              ;; we intentially avoid `with-eval-after-load' to prevent eager
              ;; macro expansion from pulling (or failing to pull) in autoload
              ;; macros/packages
              `(eval-after-load ',package ',(macroexp-progn body)))
      (let ((p (car package)))
        (cond ((not (keywordp p))
               `(:after (:and ,@package) ,@body))
              ((memq p '(:or :any))
               (macroexp-progn
                (cl-loop for next in (cdr package)
                         collect `(:after ,next ,@body))))
              ((memq p '(:and :all))
               (dolist (next (cdr package))
                 (setq body `((:after ,next ,@body))))
               (car body))))))
#+end_src

** :hook

Wrapper for the *add-hook* function

examples:
=(:hook org-mode (message "hello world"))=
=(:hook org-mode foobar)=

#+begin_src emacs-lisp
  (defmacro :hook (hook-name &rest body)
    (declare (indent defun))
    (let* ((hook-name (format "%s-hook" (symbol-name hook-name)))
           (hook-sym (intern hook-name))
           (first (car body))
           (local (eq :local first))
           (body (if local (cdr body) body))
           (first (car body))
           (body (if (consp first)
                     (if (eq (car first) 'quote)
                         first
                       `(lambda () ,@body))
                   `'.first)))
      `(add-hook ',hook-sym ,body nil ,local)))
#+end_src

** :push

Wrapper for the *add-to-list* function

example:
=(:push some-list 1 2 3)=

#+begin_src emacs-lisp
  (defmacro :push (sym &rest body)
    (declare (indent defun))
    (if (consp body)
        `(setq ,sym (-snoc ,sym ,@body))
      `(add-to-list ,sym ,body)))
#+end_src

** :bind

Either bind a key to a mode or mak a global keyboard shortcut

examples: 
=(:bind "C-m" (message "hello world"))=
=(:bind org-mode "C-m" (message "hello world"))=

#+begin_src emacs-lisp
  (defmacro :bind (key &rest body)
    (declare (indent defun))
    (pcase key
      ;; kbd string resolving symbol
      ((and k (pred symbolp) (pred boundp) (guard (stringp (eval key))))
       `(global-set-key (kbd ,(eval key)) ,(eval `(:command ,@body))))
      ;; partial mode symbol
      ((pred symbolp)
       (let ((mode (intern (format "%s-map" key)))
             (key (eval (car body)))
             (body (eval `(:command ,@(cdr body)))))
         `(define-key ,mode (kbd ,key) ,body)))
      ;; global binding
      (_ `(global-set-key (kbd ,key) ,(eval `(:command ,@body))))))
#+end_src

* global keybindings

** escape

helps with /"Emacs Pinky"/

#+begin_src emacs-lisp
  (:bind "<escape>" keyboard-escape-quit)
#+end_src

** C-x C-b

#+begin_src emacs-lisp
  (:bind "C-x C-b" buffer-menu)
#+end_src

** M-n

#+begin_src emacs-lisp
  (defun yiglas-make-frame ()
    (interactive)
    (select-frame (make-frame))
    (switch-to-buffer "*scratch*"))

  (:bind "M-n" yiglas-make-frame)
#+end_src

** C-c <arrow keys>

Move around the windows

#+begin_src emacs-lisp
  (:bind "C-c <left>" windmove-left)
  (:bind "C-c <right>" windmove-right)
  (:bind "C-c <up>" windmove-up)
  (:bind "C-c <down>" windmove-down)
#+end_src

** M-<return>

Maximize the frame

#+begin_src emacs-lisp
  (:bind "M-<return>" toggle-frame-maximized)
#+end_src

** C-x k

Kill the current buffer

#+begin_src emacs-lisp
  (:bind "C-x k" kill-current-buffer)
#+end_src

** s-/

Comment/uncomment line(s).

#+begin_src emacs-lisp
  (defun yiglas-comment-line ()
    (interactive)
    (save-excursion (comment-line 1)))

  (:bind "s-/" yiglas-comment-line)
#+end_src

** s-,

#+begin_src emacs-lisp
  (defun yiglas-open-settings ()
    (interactive)
    (find-file "~/.emacs.d/init.org"))

  (:bind "s-," yiglas-open-settings)
#+end_src

* aesthetics

