init.el
(setq user-full-name "Devin Sackett")
(setq user-mail-address "dsac@hotmail.com")

(scroll-bar-mode -1)

(tool-bar-mode -1)

(tooltip-mode -1)

(menu-bar-mode -1)

(setq inhibit-startup-message t
      initial-scratch-message ""
      initial-major-mode 'fundamental-mode)

(setq visible-bell 1)
(setq ring-bell-function 'ignore)

(defun yiglas-display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                     (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'yiglas-display-startup-time)

;; (defvar bootstrap-version)
;; (let ((bootstrap-file
;;        (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
;;       (bootstrap-version 5))
;;   (unless (file-exists-p bootstrap-file)
;;     (with-current-buffer
;;         (url-retrieve-synchronously
;;          "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
;;          'silent 'inhibit-cookies)
;;       (goto-char (point-max))
;;       (eval-print-last-sexp)))
;;   (load bootstrap-file nil 'nomessage))

;; (setq straight-use-package-by-default t)

;; (straight-use-package 'use-package)

;; (require 'use-package)
;; (setq use-package-always-ensure t)
;; (setq use-package-verbose t)

;; (use-package git) ;; ensure we can install from git sources

(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
(setq use-package-verbose t)

(defmacro :func (&rest body)
  (if (< (length body) 1)
      `(lambda () ,@body)
    (pcase (car body)
      ;; command symbol
      ((and v (pred commandp))
       `(lambda () (call-interactively (quote ,v))))
      ;; function symbol
      ((and v (pred symbolp))
       `(lambda () (,v)))
      ;; quoted command symbol
      ((and v (pred consp) (guard (eq 'quote (car v))) (pred commandp (cadr v)))
       `(lambda () (call-interactively ,v)))
      ;; quoted function symbol
      ((and v (pred consp) (guard (eq 'quote (car v))))
       `(lambda () (,(cadr v))))
      ;; body format
      (_ `(lambda () ,@body)))))

(defmacro :command (&rest body)
  (if (< (length body) 1)
      `(lambda () (interactive) ,@body)
    (pcase (car body)
      ;; command symbol
      ((and v (pred commandp))
       `(lambda () (interactive) (call-interactively (quote ,v))))
      ;; function symbol
      ((and v (pred symbolp))
       `(lambda () (interactive) (,v)))
      ;; quoted command symbol
      ((and v (pred consp) (guard (eq 'quote (car v))) (pred commandp (cadr v)))
       `(lambda () (interactive) (call-interactively ,v)))
      ;; quoted function symbol
      ((and v (pred consp) (guard (eq 'quote (car v))))
       `(lambda () (interactive) (,(cadr v))))
      ;; body forms
      (_ `(lambda () (interactive) ,@body)))))

;; (defmacro :after (package &rest body)
;;   (declare (indent defun))
;;   `(with-eval-after-load ',package ,@body))

(defmacro :after (package &rest body)
  (declare (indent defun) (debug t))
  (if (symbolp package)
      (list (if (or (not (bound-and-true-p byte-compile-current-file))
                    (require package nil 'noerror))
                #'progn
              #'with-no-warnings)
            ;; we intentially avoid `with-eval-after-load' to prevent eager
            ;; macro expansion from pulling (or failing to pull) in autoload
            ;; macros/packages
            `(eval-after-load ',package ',(macroexp-progn body)))
    (let ((p (car package)))
      (cond ((not (keywordp p))
             `(:after (:and ,@package) ,@body))
            ((memq p '(:or :any))
             (macroexp-progn
              (cl-loop for next in (cdr package)
                       collect `(:after ,next ,@body))))
            ((memq p '(:and :all))
             (dolist (next (cdr package))
               (setq body `((:after ,next ,@body))))
             (car body))))))

(defmacro :hook (hook-name &rest body)
  (declare (indent defun))
  (let* ((hook-name (format "%s-hook" (symbol-name hook-name)))
         (hook-sym (intern hook-name))
         (first (car body))
         (local (eq :local first))
         (body (if local (cdr body) body))
         (first (car body))
         (body (if (consp first)
                   (if (eq (car first) 'quote)
                       first
                     `(lambda () ,@body))
                 `'.first)))
    `(add-hook ',hook-sym ,body nil ,local)))

(defmacro :push (sym &rest body)
  (declare (indent defun))
  (if (consp body)
      `(setq ,sym (-snoc ,sym ,@body))
    `(add-to-list ,sym ,body)))

(defmacro :bind (key &rest body)
  (declare (indent defun))
  (pcase key
    ;; kbd string resolving symbol
    ((and k (pred symbolp) (pred boundp) (guard (stringp (eval key))))
     `(global-set-key (kbd ,(eval key)) ,(eval `(:command ,@body))))
    ;; partial mode symbol
    ((pred symbolp)
     (let ((mode (intern (format "%s-map" key)))
           (key (eval (car body)))
           (body (eval `(:command ,@(cdr body)))))
       `(define-key ,mode (kbd ,key) ,body)))
    ;; global binding
    (_ `(global-set-key (kbd ,key) ,(eval `(:command ,@body))))))

(:bind "<escape>" keyboard-escape-quit)

(:bind "C-x C-b" buffer-menu)

(defun yiglas-make-frame ()
  (interactive)
  (select-frame (make-frame))
  (switch-to-buffer "*scratch*"))

(:bind "M-n" yiglas-make-frame)

(:bind "C-c <left>" windmove-left)
(:bind "C-c <right>" windmove-right)
(:bind "C-c <up>" windmove-up)
(:bind "C-c <down>" windmove-down)

(:bind "M-<return>" toggle-frame-maximized)

(:bind "C-x k" kill-current-buffer)

(defun yiglas-comment-line ()
  (interactive)
  (save-excursion (comment-line 1)))

(:bind "s-/" yiglas-comment-line)

(defun yiglas-open-settings ()
  (interactive)
  (find-file "~/.emacs.d/init.org"))

(:bind "s-," yiglas-open-settings)
