init.org
** font

Default font is [[https://github.com/JetBrains/JetBrainsMono][JetBrains Mono]]

#+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "JetBrains Mono")
#+end_src

** column number

Show column number in additional to the line number.

#+begin_src emacs-lisp
  (column-number-mode)
#+end_src

** fringe

#+begin_src emacs-lisp
  (set-fringe-mode 10)
#+end_src

** line numbers

#+begin_src emacs-lisp
  (global-display-line-numbers-mode)
  (setq display-line-numbers-type 'relative)
#+end_src

*** disable line number for specific modes

#+begin_src emacs-lisp
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  debugger-mode-hook
                  compilation-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode -1))))
#+end_src

** theme

#+begin_src emacs-lisp
  (use-package doom-themes
    :init (load-theme 'doom-nord t)
    :config
    (setq doom-themes-treemacs-theme "doom-colors")
    (doom-themes-treemacs-config))
#+end_src

** all-the-icons

#+begin_src emacs-lisp
  (use-package all-the-icons)
#+end_src

** modeline

Use [[https://github.com/seagle0128/doom-modeline][doom-modeline]]  to clean up the modeline.

#+begin_src emacs-lisp
  (use-package doom-modeline
    :init (doom-modeline-mode t)
    :custom-face
    (mode-line ((t (:height 0.85))))
    (mode-line-inactive ((t (:height 0.85))))
    :custom
    (doom-modeline-height 15)
    (doom-modeline-bar-width 6)
    (doom-modeline-lsp t)
    (doom-modeline-github nil)
    (doom-modeline-persp-name nil)
    (doom-modeline-buffer-file-name-style 'truncate-except-project)
    (doom-modeline-major-mode-icon nil)
    (doom-modeline-buffer-encoding nil))
#+end_src

** transparency

#+begin_src emacs-lisp
  (defvar yiglas-frame-transparency '(90 . 90))

  ;; (set-frame-parameter (selected-frame) 'alpha yiglas-frame-transparency)
  ;; (:push default-frame-alist '(alpha . ,yiglas-frame-transparency))
#+end_src

* core settings

** accept redefinition action

#+begin_src emacs-lisp
  (setq ad-redefinition-action 'accept)
#+end_src

** no-littering

Keep *~/.emacs.d* clean by using the [[https://github.com/emacscollective/no-littering][no-littering]] package.

#+begin_src emacs-lisp
  (use-package no-littering)
#+end_src

*** autosave

No-littering package doesn't set the default auto save directory, need to set it manually.

#+begin_src emacs-lisp
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+end_src

** minor-modes

*** rainbow-delimeters

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth.  This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*** show-paren-mode

#+begin_src emacs-lisp
  (show-paren-mode t)
#+end_src

*** format 

**** prettier-js

[[https://github.com/prettier/prettier-emacs][prettier-js]] formats typescript buffers

#+begin_src emacs-lisp
  (use-package prettier-js
    :hook (typescript-mode . prettier-js-mode))
#+end_src

**** format-all

[[https://github.com/lassik/emacs-format-all-the-code][format-all]] formats the current buffer.  Do we even need to include *prettier-js*?

#+begin_src emacs-lisp
  (use-package format-all
    :hook (prog-mode . format-all-mode))
#+end_src

*** which-key

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in Emacs.

#+begin_src emacs-lisp
  (use-package which-key
    :defer 0
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 0.5))
#+end_src

*** company

[[https://company-mode.github.io][company]] provides a nicer in-buffer completion interface.

#+begin_src emacs-lisp
  (use-package company
    :hook (prog-mode . company-mode)
    :bind
    (:map company-active-map
          ("<tab>" . company-complete-selection))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (:after company
    (:bind "s-." company-search-candidates))
#+end_src

**** company-box

[[https://github.com/sebastiencs/company-box][company-box]] further enhances the look of company mode

#+begin_src emacs-lisp
  (use-package company-box
    :hook (company-mode . company-box-mode))
#+end_src

*** smartparens

[[https://github.com/Fuco1/smartparens][smartparens]] helps deal with matching pair of parens

#+begin_src emacs-lisp
  ;; (use-package smartparens
  ;;   :init (smartparens-global-mode)
  ;;   :defer 1
  ;;   :config
  ;;   (require 'smartparens-config))

  (electric-pair-mode 1)
#+end_src

*** dimmer

[[https://github.com/gonewest818/dimmer.el][dimmer]] indicates the currently active buffer by dimming the faces in the other buffers

#+begin_src emacs-lisp
  (use-package dimmer
    :defer 1
    :config
    (dimmer-configure-which-key)
    (dimmer-mode t))
#+end_src

*** hl-todo

[[https://github.com/tarsius/hl-todo][hl-todo]] highlights keywords individual buffers.

#+begin_src emacs-lisp
  (use-package hl-todo
    :hook (prog-mode . hl-todo-mode)
    :config
    (setq hl-todo-highlight-punctuation ":"
          hl-todo-keyword-faces
          `(;; For things that need to be done, just not today.
            ("TODO" warning bold)
            ;; For problems that will become bigger problems later if not
            ;; fixed ASAP.
            ("FIXME" error bold)
            ;; For tidbits that are unconventional and not intended uses of the
            ;; constituent parts, and may break in a future update.
            ("HACK" font-lock-constant-face bold)
            ;; For things that were done hastily and/or hasn't been thoroughly
            ;; tested. It may not even be necessary!
            ("REVIEW" font-lock-keyword-face bold)
            ;; For especially important gotchas with a given implementation,
            ;; directed at another user other than the author.
            ("NOTE" success bold)
            ;; For things that just gotta go and will soon be gone.
            ("DEPRECATED" font-lock-doc-face bold)
            ;; For a known bug that needs a workaround
            ("BUG" error bold)
            ;; For warning about a problematic or misguiding code
            ("XXX" font-lock-constant-face bold))))
#+end_src

** shorten prompts

Shorten yes/no prompts to y/n

#+begin_src emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)
#+end_src

** cache

[[https://github.com/rolandwalker/persistent-soft][persistent-soft]] is a persisten storgage for Emacs.

#+begin_src emacs-lisp
  (use-package persistent-soft)
#+end_src

*** cache store name

#+begin_src emacs-lisp
  (defvar yiglas-cache-location "yiglas-emacs-cache")
#+end_src

*** :cache

#+begin_src emacs-lisp
  (defmacro :cache-set (n v)
    (declare (indent defun))
    `(persistent-soft-store ,n ,v "yiglas-data-store"))

  (defmacro :cache-get (n)
    (declare (indent defun))
    `(persistent-soft-fetch ,n "yiglas-data-store"))
#+end_src

** initial start

*** load last save frame dimensions

Restore the last known dimensions and position of Emacs.

#+begin_src emacs-lisp
  (defun yiglas-set-frame-dimensions ()
    (interactive)
    (when-let (dims (:cache-get 'last-frame-size))
      (cl-destructuring-bind ((a-left . a-top) a-width a-height a-fullscreen) dims
        (set-frame-position (selected-frame) a-left a-top)
        (set-frame-size (selected-frame) a-width a-height))))

  (add-hook 'emacs-startup-hook #'yiglas-set-frame-dimensions)
#+end_src

*** save frame dimensions

Save the frame dimensions when Emacs quits.

#+begin_src emacs-lisp
  (defun yiglas-save-frame-dimensions ()
    (:cache-set 'last-frame-size
      (list (frame-position)
            (frame-width)
            (frame-height)
            (frame-parameter nil 'fullscreen))))

  (add-hook 'kill-emacs-hook #'yiglas-save-frame-dimensions)
#+end_src

** line wrap

do not wrap lines in prog-mode

#+begin_src emacs-lisp
  (:hook prog-mode (toggle-truncate-lines 1))
#+end_src

* helpful

[[https://github.com/Wilfred/helpful][helpful]] add more contextual information to the built in Emacs' *describe* command buffers.

#+begin_src emacs-lisp
  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :bind
    (("C-h s" . #'helpful-symbol)
     ("C-h c" . #'helpful-command)
     ("C-h f" . #'helpful-function)
     ("C-h v" . #'helpful-variable)
     ("C-h k" . #'helpful-key)
     ("C-h m" . #'helpful-mode)
     ("C-h C-h" . #'helpful-at-point)))
#+end_src

* projectile

[[https://projectile.mx][projectile]] is a project management library for Emacs. Projectile makes it a lot easier to navigate around code projects.

#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    (setq projectile-project-root-files-bottom-up
          (append '(".projectile" ; projectile's root marker
                    ".git" ; git VCS root dir
                    "README.md"
                    ))
          projectile-project-root-files '()
          projectile-project-root-files-top-down-recurring '("Makefile"))
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (setq projectile-globally-ignored-files '(".DS_Store" "TAGS")
          projectile-auto-discover nil
          projectile-switch-project-action #'projectile-dired)
    (when (file-directory-p "~/code")
      (setq projectile-project-search-path `("~/code"))))
#+end_src

** counsel-projectile

[[https://github.com/ericdanan/counsel-projectile][counsel-projectile]] provides additional ivy integration 

#+begin_src emacs-lisp
  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))
#+end_src

