init.el

(set-face-attribute 'default nil :font "JetBrains Mono")

(column-number-mode)

(set-fringe-mode 10)

(global-display-line-numbers-mode)
(setq display-line-numbers-type 'relative)

(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                debugger-mode-hook
                compilation-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode -1))))

(use-package doom-themes
  :init (load-theme 'doom-nord t)
  :config
  (setq doom-themes-treemacs-theme "doom-colors")
  (doom-themes-treemacs-config))

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode t)
  :custom-face
  (mode-line ((t (:height 0.85))))
  (mode-line-inactive ((t (:height 0.85))))
  :custom
  (doom-modeline-height 15)
  (doom-modeline-bar-width 6)
  (doom-modeline-lsp t)
  (doom-modeline-github nil)
  (doom-modeline-persp-name nil)
  (doom-modeline-buffer-file-name-style 'truncate-except-project)
  (doom-modeline-major-mode-icon nil)
  (doom-modeline-buffer-encoding nil))

(defvar yiglas-frame-transparency '(90 . 90))

;; (set-frame-parameter (selected-frame) 'alpha yiglas-frame-transparency)
;; (:push default-frame-alist '(alpha . ,yiglas-frame-transparency))

(setq ad-redefinition-action 'accept)

(use-package no-littering)

(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(show-paren-mode t)

(use-package prettier-js
  :hook (typescript-mode . prettier-js-mode))

(use-package format-all
  :hook (prog-mode . format-all-mode))

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-idle-delay 0.5))

(use-package company
  :hook (prog-mode . company-mode)
  :bind
  (:map company-active-map
        ("<tab>" . company-complete-selection))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(:after company
  (:bind "s-." company-search-candidates))

(use-package company-box
  :hook (company-mode . company-box-mode))

;; (use-package smartparens
;;   :init (smartparens-global-mode)
;;   :defer 1
;;   :config
;;   (require 'smartparens-config))

(electric-pair-mode 1)

(use-package dimmer
  :defer 1
  :config
  (dimmer-configure-which-key)
  (dimmer-mode t))

(use-package hl-todo
  :hook (prog-mode . hl-todo-mode)
  :config
  (setq hl-todo-highlight-punctuation ":"
        hl-todo-keyword-faces
        `(;; For things that need to be done, just not today.
          ("TODO" warning bold)
          ;; For problems that will become bigger problems later if not
          ;; fixed ASAP.
          ("FIXME" error bold)
          ;; For tidbits that are unconventional and not intended uses of the
          ;; constituent parts, and may break in a future update.
          ("HACK" font-lock-constant-face bold)
          ;; For things that were done hastily and/or hasn't been thoroughly
          ;; tested. It may not even be necessary!
          ("REVIEW" font-lock-keyword-face bold)
          ;; For especially important gotchas with a given implementation,
          ;; directed at another user other than the author.
          ("NOTE" success bold)
          ;; For things that just gotta go and will soon be gone.
          ("DEPRECATED" font-lock-doc-face bold)
          ;; For a known bug that needs a workaround
          ("BUG" error bold)
          ;; For warning about a problematic or misguiding code
          ("XXX" font-lock-constant-face bold))))

(fset 'yes-or-no-p 'y-or-n-p)

(use-package persistent-soft)

(defvar yiglas-cache-location "yiglas-emacs-cache")

(defmacro :cache-set (n v)
  (declare (indent defun))
  `(persistent-soft-store ,n ,v "yiglas-data-store"))

(defmacro :cache-get (n)
  (declare (indent defun))
  `(persistent-soft-fetch ,n "yiglas-data-store"))

(defun yiglas-set-frame-dimensions ()
  (interactive)
  (when-let (dims (:cache-get 'last-frame-size))
    (cl-destructuring-bind ((a-left . a-top) a-width a-height a-fullscreen) dims
      (set-frame-position (selected-frame) a-left a-top)
      (set-frame-size (selected-frame) a-width a-height))))

(add-hook 'emacs-startup-hook #'yiglas-set-frame-dimensions)

(defun yiglas-save-frame-dimensions ()
  (:cache-set 'last-frame-size
    (list (frame-position)
          (frame-width)
          (frame-height)
          (frame-parameter nil 'fullscreen))))

(add-hook 'kill-emacs-hook #'yiglas-save-frame-dimensions)

(:hook prog-mode (toggle-truncate-lines 1))

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :bind
  (("C-h s" . #'helpful-symbol)
   ("C-h c" . #'helpful-command)
   ("C-h f" . #'helpful-function)
   ("C-h v" . #'helpful-variable)
   ("C-h k" . #'helpful-key)
   ("C-h m" . #'helpful-mode)
   ("C-h C-h" . #'helpful-at-point)))

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  (setq projectile-project-root-files-bottom-up
        (append '(".projectile" ; projectile's root marker
                  ".git" ; git VCS root dir
                  "README.md"
                  ))
        projectile-project-root-files '()
        projectile-project-root-files-top-down-recurring '("Makefile"))
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (setq projectile-globally-ignored-files '(".DS_Store" "TAGS")
        projectile-auto-discover nil
        projectile-switch-project-action #'projectile-dired)
  (when (file-directory-p "~/code")
    (setq projectile-project-search-path `("~/code"))))

(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))

(use-package ivy
  :diminish
  :bind
  (("s-f" . swiper)
