init.org
* ivy

[[https://oremacs.com/swiper][ivy]] is an excfllent completion framework for emacs

#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind
    (("s-f" . swiper)
     :map ivy-minibuffer-map
     ("TAB" . ivy-alt-done)
     ("C-l" . ivy-alt-done)
     ("C-j" . ivy-next-line)
     ("C-k" . ivy-previous-line)
     :map ivy-switch-buffer-map
     ("C-k" . ivy-previous-line)
     ("C-l" . ivy-done)
     ("C-d" . ivy-switch-buffer-kill)
     :map ivy-reverse-i-search-map
     ("C-k" . ivy-previous-line)
     ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode t))
#+end_src

** ivy-rich

[[https://github.com/Yevgnen/ivy-rich][ivy-rich]] add extra columns to a few of the counsel commands to provide more information about each item

#+begin_src emacs-lisp
  (use-package ivy-rich
    :after ivy
    :defer 1
    :init  (ivy-rich-mode t)
    :config
    (plist-put ivy-rich-display-transformers-list
               'counsel-M-x
               '(:columns ((counsel-M-x-transformer (:width 60))
                           (ivy-rich-counsel-function-docstring (:face font-lock-doc-face))))))
#+end_src

** counsel

Extend ivy with additional customized Emacs commands

#+begin_src emacs-lisp
  (use-package counsel
    :defer 1
    :bind
    (("C-M-j" . 'counsel-switch-buffer)
     :map minibuffer-local-map
     ("C-r" . 'counsel-minibuffer-history))
    :custom
    (counsel-linux-app-format-functiono #'counsel-linux-app-format-function-name-only)
    :config
    (counsel-mode t)
    (setq counsel-find-file-ignore-regexp "\\(?:^[#.]\\)\\|\\(?:[#~]$\\)\\|\\(?:^Icon?\\)"))
#+end_src

* persp

[[https://github.com/Bad-ptr/persp-mode.el][persp]] 

#+begin_src emacs-lisp
  (use-package persp-mode
    :commands persp-switch-to-buffer
    :config
    (setq persp-autokill-buffer-on-remove 'kill-weak
          persp-reset-windows-on-nil-window-conf nil
          persp-nil-hidden t
          persp-auto-save-fname "autosave"
          persp-switch-to-added-buffer nil
          persp-kill-foreign-buffer-behaviour 'kill
          persp-remove-buffers-from-nil-persp-behaviour nil
          persp-auto-resume-time -1
          persp-auto-save-opt (if noninteractive 0 1)))
#+end_src

* treemacs

[[https://github.com/Alexander-Miller/treemacs][treemacs]] enables a tree layout file explorer for Emacs.

#+begin_src emacs-lisp
  (use-package treemacs
    :bind ("C-x t" . treemacs)
    :init
    (setq treemacs-sorting 'alphabetic-case-insensitive-asc
          treemacs-follow-mode t
          treemacs-follow-after-init t
          treemacs-is-never-other-window nil)
    :config
    (global-set-key (kbd "C-x t") 'treemacs)
    (treemacs-follow-mode -1))
#+end_src

** treemacs-projectile

#+begin_src emacs-lisp
  (use-package treemacs-projectile
    :after (treemacs projectile))
#+end_src

** treemacs-magit

#+begin_src emacs-lisp
  (use-package treemacs-magit
    :after (treemacs magit))
#+end_src

** treemacs-persp

#+begin_src emacs-lisp
  (use-package treemacs-persp
    :after (treemacs persp-mode)
    :config
    (treemacs-set-scope-type 'Perspectives))
#+end_src

* yasnippet

[[https://github.com/joaotavora/yasnippet][yasnippet]] is a templating engine for Emacs.

* magit

[[https://magit.vc][magit]] is a complete text-based UI for Git in Emacs.

#+begin_src emacs-lisp
  (use-package magit
    :commands magit-status
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

** forge

[[https://github.com/magit/forge][forge]] enabled Magit to work with Git forges.

#+begin_src emacs-lisp
  (use-package forge
    :after magit)
#+end_src

* org

[[https://orgmode.org][org]] is on of the hallmark features of Emacs.

#+begin_src emacs-lisp
  (use-package org
    :commands (org-capture org-agenda)
    :config
    (setq org-ellipsis " ▾")

    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)

    (setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
	(sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

    (setq org-refile-targets
      '(("Archive.org" :maxlevel . 1)
	("Tasks.org" :maxlevel . 1)))

    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    (setq org-tag-alist
      '((:startgroup)
	 ; Put mutually exclusive tags here
	 (:endgroup)
	 ("@errand" . ?E)
	 ("@home" . ?H)
	 ("@work" . ?W)
	 ("agenda" . ?a)
	 ("planning" . ?p)
	 ("publish" . ?P)
	 ("batch" . ?b)
	 ("note" . ?n)
	 ("idea" . ?i)))

    ;; Configure custom agenda views
    (setq org-agenda-custom-commands
	  '(("d" "Dashboard"
	     ((agenda "" ((org-deadline-warning-days 7)))
	      (todo "NEXT"
		    ((org-agenda-overriding-header "Next Tasks")))
	      (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

	    ("n" "Next Tasks"
	     ((todo "NEXT"
		    ((org-agenda-overriding-header "Next Tasks")))))

	    ("W" "Work Tasks" tags-todo "+work-email")
	    ;; Low-effort next actions
	    ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
	     ((org-agenda-overriding-header "Low Effort Tasks")
	      (org-agenda-max-todos 20)
	      (org-agenda-files org-agenda-files)))

	    ("w" "Workflow Status"
	     ((todo "WAIT"
		    ((org-agenda-overriding-header "Waiting on External")
		     (org-agenda-files org-agenda-files)))
	      (todo "REVIEW"
		    ((org-agenda-overriding-header "In Review")
		     (org-agenda-files org-agenda-files)))
	      (todo "PLAN"
		    ((org-agenda-overriding-header "In Planning")
		     (org-agenda-todo-list-sublevels nil)
		     (org-agenda-files org-agenda-files)))
	      (todo "BACKLOG"
		    ((org-agenda-overriding-header "Project Backlog")
		     (org-agenda-todo-list-sublevels nil)
		     (org-agenda-files org-agenda-files)))
	      (todo "READY"
		    ((org-agenda-overriding-header "Ready for Work")
		     (org-agenda-files org-agenda-files)))
	      (todo "ACTIVE"
		    ((org-agenda-overriding-header "Active Projects")
		     (org-agenda-files org-agenda-files)))
	      (todo "COMPLETED"
		    ((org-agenda-overriding-header "Completed Projects")
		     (org-agenda-files org-agenda-files)))
	      (todo "CANC"
		    ((org-agenda-overriding-header "Cancelled Projects")
		     (org-agenda-files org-agenda-files)))))))

    (setq org-capture-templates
	  `(("t" "Tasks / Projects")
	    ("tt" "Task" entry (file+olp "~/Projects/Code/emacs-from-scratch/OrgFiles/Tasks.org" "Inbox")
	     "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

	    ("j" "Journal Entries")
	    ("jj" "Journal" entry
	     (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
	     "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
	     ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
	     :clock-in :clock-resume
	     :empty-lines 1)
	    ("jm" "Meeting" entry
	     (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
	     "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
	     :clock-in :clock-resume
	     :empty-lines 1)

	    ("w" "Workflows")
	    ("we" "Checking Email" entry (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
	     "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

	    ("m" "Metrics Capture")
	    ("mw" "Weight" table-line (file+headline "~/Projects/Code/emacs-from-scratch/OrgFiles/Metrics.org" "Weight")
	     "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)))

    (define-key global-map (kbd "C-c j")
      (lambda () (interactive) (org-capture nil "jj")))
  
    (custom-theme-set-faces
     'user
     '(org-block ((t (:inherit fixed-pitch))))
     '(org-code ((t (:inherit (shadow fixed-pitch)))))
     '(org-document-info ((t (:foreground "dark orange"))))
     '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
     '(org-indent ((t (:inherit (org-hide fixed-pitch)))))
     '(org-link ((t (:foreground "royal blue" :underline t))))
     '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
     '(org-property-value ((t (:inherit fixed-pitch))) t)
     '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
     '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
     '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
     '(org-verbatim ((t (:inherit (shadow fixed-pitch)))))))
#+end_src

** customize org mode

#+begin_src emacs-lisp
  (defun yiglas-org-mode ()
    (org-indent-mode)
    (variable-pitch-mode t)
    (visual-line-mode t))

  (:hook org-mode 'yiglas-org-mode)
#+end_src

