init.org
** org-superstar

[[https://github.com/integral-dw/org-superstar-mode][org-superstar]] prettifies headers and plain list during Org mode.

#+begin_src emacs-lisp
  (use-package org-superstar
    :after org
    :hook (org-mode . org-superstar-mode)
    :custom
    (org-superstar-remove-leading-stars t)
    (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

** org-babel

To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language used. Languages supported by org babel can be found [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][here]].

#+begin_src emacs-lisp
  (:after org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)))
    (push '("conf-unix" . conf-unix) org-src-lang-modes))
#+end_src

** org-tempo

Org mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature in combination with =org-tempo= enables you to quickly insert code blocks into your Org files. Type =<= followed by the template name like =el= and then press =<TAB>=.

#+begin_src emacs-lisp
  (:after org
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp")))
#+end_src

** tangling

Auto-tangle after save

#+begin_src emacs-lisp
  (defun yiglas-org-babel-tangle-config ()
    (when (string-equal (file-name-directory (buffer-file-name))
			(expand-file-name user-emacs-directory))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
	(org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'yiglas-org-babel-tangle-config)))
#+end_src

* language support

** flycheck

[[https://www.flycheck.org/en/latest][flycheck]] is a modern on-the-fly syntax checking extensions for Emacs.

#+begin_src emacs-lisp
  (use-package flycheck
    :init (global-flycheck-mode)
    :defer 1)
#+end_src

** lsp

[[https://emacs-lsp.github.io/lsp-mode/][lsp]] enables IDE-like functionality for many different programming languages.

#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :bind
    (("<f12>" . 'lsp-find-definition)
     ("C-<f12>" . 'lsp-find-implementation)
     ("C--" . 'pop-global-mark)
     :map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t)
    (lsp-headerline-breadcrumb-mode -1))
#+end_src

*** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui][lsp-ui]] is a set of UI enhancements build on top of =lsp= which makes Emacs feel even more like an IDS.

#+begin_src emacs-lisp
  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))
#+end_src

** eglot

[[https://github.com/joaotavora/eglot][eglot]] enables IDE-Like functionality but it's out of your way!

#+begin_src emacs-lisp
  (use-package eglot
    :commands (eglot eglot-ensure)
    :config
    (add-to-list 'eglot-server-programs '(csharp-mode . ("/Users/dsac/.emacs.d/var/lsp/server/omnisharp-roslyn/v1.37.7/run")))
    (add-to-list 'eglot-server-programs '(typescript-mode . ("deno" "lsp"))))
#+end_src

** dap

[[https://emacs-lsp.github.io/dap-mode/][dap]] is an Emacs client/library for the Debug Adapter Protocol.

#+begin_src emacs-lisp
  (use-package dap-mode
    :custom
    (lsp-enable-dap-auto-configure nil)
    :commands dap-debug
    :config
    (dap-ui-mode t)
    (require 'dap-node))
#+end_src

** tree-sitter

[[https://ubolonton.github.io/emacs-tree-sitter][tree-sitter]] is an incremental parsing system for Emacs. 

#+begin_src emacs-lisp
  (use-package tree-sitter
    :defer 1)
#+end_src

*** tree-sitter-langs

#+begin_src emacs-lisp
  (use-package tree-sitter-langs
    :defer 1)
#+end_src

** typescript

#+begin_src emacs-lisp
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :mode "\\.tsx\\'"
    :config
    (:hook typescript-mode 'lsp-deferred)
    (setq typescript-indent-level 2))
#+end_src

** c#

[[https://github.com/emacs-csharp/csharp-mode][csharp]] mode enabled C# editing in Emacs.

#+begin_src emacs-lisp
  (use-package csharp-mode
    :mode "\\.cs\\'"
    :mode "\\.csx\\'"
    :config
    (:hook csharp-mode 'lsp-deferred)
    (add-to-list 'auto-mode-alist '("\\.cs\\'" . csharp-tree-sitter-mode))
    (add-to-list 'auto-mode-alist '("\\.csx\\'" . csharp-tree-sitter-mode)))
#+end_src

*** customize csharp & lsp mode

#+begin_src emacs-lisp
    (defun yiglas-csharp-lsp-mode ()
      ;; todo push this to .dir-locals.el???
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]tools\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\].docz\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]TestOutput\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]Terraform\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]QAAutomation\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]bin\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]certs\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]LoadTests\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]Artifacts\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]E2E\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]Database\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]Workspace\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\].azuredevops\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\].docker\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\].log\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\].vs\\'")
      (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]Dependencies\\'"))

    (:hook lsp-mode 'yiglas-csharp-lsp-mode)
#+end_src

*** sharper

[[https://github.com/sebasmonia/sharper][sharper]] is a dotnet cli wrapper, using [[https://github.com/magit/transient][transient]] command menu.

#+begin_src emacs-lisp
  (use-package sharper
    :bind
    ("C-x d" . sharper-main-transient))
#+end_src

** dotenv

[[https://github.com/preetpalS/emacs-dotenv-mode][dotenv]] mode enabled .env editing in Emacs.

#+begin_src emacs-lisp
  (use-package dotenv-mode
    :mode "\\.env\\'"
    :mode "\\.env.example\\'")
#+end_src

* misc

** eshell-toggle

[[https://github.com/4DA/eshell-toggle][eshell-toggle]] shows/hides the eshell terminal

#+begin_src emacs-lisp
  (use-package eshell-toggle
    :bind ("C-M-'" . eshell-toggle)
    :custom
    (eshell-toggle-size-fraction 3)
    (eshell-toggle-use-projectile-root t)
    (eshell-toggle-run-command nil))
#+end_src

** git-gutter

[[https://github.com/tarsius/hl-todo][git-gutter]] indicates git changes for a individual buffer

#+begin_src emacs-lisp
  (use-package git-gutter
    :diminish
    :hook ((text-mode prog-mode) . git-gutter-mode)
    :config
    (setq git-gutter:update-interval 2))
#+end_src

** persistent-scratch

[[https://github.com/Fanael/persistent-scratch][persistent-scratch]] preserves the state of the scratch buffer in Emacs.

#+begin_src emacs-lisp
  (use-package persistent-scratch
    :commands persistent-scratch-setup-default
    :hook (after-init . persistent-scratch-setup-default))
#+end_src

** spelling

#+begin_src emacs-lisp
  (setq ispell-program-name "aspell")
  (setq ispell-extra-args '("--camel-case" "--sug-mode=ultra" "--lang=en_US" "--run-together" "--run-together-limit=16"))
#+end_src

** wucuo

[[https://github.com/redguardtoo/wucuo][wucuo]] is a spell check solution for camel case code or plain text.

#+begin_src emacs-lisp
  (use-package wucuo
    :hook ((text-mode prog-mode) . wucuo-start))
#+end_src





