init.el

(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-remove-leading-stars t)
  (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●")))

(:after org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)))
  (push '("conf-unix" . conf-unix) org-src-lang-modes))

(:after org
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp")))

(defun yiglas-org-babel-tangle-config ()
  (when (string-equal (file-name-directory (buffer-file-name))
		      (expand-file-name user-emacs-directory))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'yiglas-org-babel-tangle-config)))

(use-package flycheck
  :init (global-flycheck-mode)
  :defer 1)

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :bind
  (("<f12>" . 'lsp-find-definition)
   ("C-<f12>" . 'lsp-find-implementation)
   ("C--" . 'pop-global-mark)
   :map lsp-mode-map
        ("<tab>" . company-indent-or-complete-common))
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t)
  (lsp-headerline-breadcrumb-mode -1))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package eglot
  :commands (eglot eglot-ensure)
  :config
  (add-to-list 'eglot-server-programs '(csharp-mode . ("/Users/dsac/.emacs.d/var/lsp/server/omnisharp-roslyn/v1.37.7/run")))
  (add-to-list 'eglot-server-programs '(typescript-mode . ("deno" "lsp"))))

(use-package dap-mode
  :custom
  (lsp-enable-dap-auto-configure nil)
  :commands dap-debug
  :config
  (dap-ui-mode t)
  (require 'dap-node))

(use-package tree-sitter
  :defer 1)

(use-package tree-sitter-langs
  :defer 1)

(use-package typescript-mode
  :mode "\\.ts\\'"
  :mode "\\.tsx\\'"
  :config
  (:hook typescript-mode 'lsp-deferred)
  (setq typescript-indent-level 2))

(use-package csharp-mode
  :mode "\\.cs\\'"
  :mode "\\.csx\\'"
  :config
  (:hook csharp-mode 'lsp-deferred)
  (add-to-list 'auto-mode-alist '("\\.cs\\'" . csharp-tree-sitter-mode))
  (add-to-list 'auto-mode-alist '("\\.csx\\'" . csharp-tree-sitter-mode)))

(defun yiglas-csharp-lsp-mode ()
  ;; todo push this to .dir-locals.el???
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]tools\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\].docz\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]TestOutput\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]Terraform\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]QAAutomation\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]bin\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]certs\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]LoadTests\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]Artifacts\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]E2E\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]Database\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]Workspace\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\].azuredevops\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\].docker\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\].log\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\].vs\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]Dependencies\\'"))

(:hook lsp-mode 'yiglas-csharp-lsp-mode)

(use-package sharper
  :bind
  ("C-x d" . sharper-main-transient))

(use-package dotenv-mode
  :mode "\\.env\\'"
  :mode "\\.env.example\\'")

(use-package eshell-toggle
  :bind ("C-M-'" . eshell-toggle)
  :custom
  (eshell-toggle-size-fraction 3)
  (eshell-toggle-use-projectile-root t)
  (eshell-toggle-run-command nil))

(use-package git-gutter
  :diminish
  :hook ((text-mode prog-mode) . git-gutter-mode)
  :config
  (setq git-gutter:update-interval 2))

(use-package persistent-scratch
  :commands persistent-scratch-setup-default
  :hook (after-init . persistent-scratch-setup-default))

(setq ispell-program-name "aspell")
(setq ispell-extra-args '("--camel-case" "--sug-mode=ultra" "--lang=en_US" "--run-together" "--run-together-limit=16"))

(use-package wucuo
  :hook ((text-mode prog-mode) . wucuo-start))
